const questionsFixed = [
  "Что называют моментом инерции?",
  "Из чего состоит установка?",
  "Чем является выражение?",
  "Чем является изменение?",
  "Чем является формула?",
  "Что называют погрешностью?",
  "Что такое инертность?",
  "От чего зависит момент инерции тела?",
  "Что такое плотность?",
  "Что называют установкой?",
  "Как звучит теорема Штейнера?",
  "Что означает aддитивность момента инерции?",
  "Что такое момент инерции?",
  "Чему равен момент инерций?",
  "В чём измеряется момент инерции?",
  "Как обозначается момент инерции?",
  "Как различают момент инерции?",
  "Что называют энергией?",
  "Что такое масса?",
  "Что называется моментами инерции механической системы?",
  "Чем является осевой момент инерции тела?",
  "В чем измеряется масса?",
  "В чем измеряется объём?",
  "В чем измеряется расстояние?",
  "В чем измеряется плотность?",
  "В чем измеряется время?",
  "Как закрепляется исследуемое тело?",
  "Кем введена теорема Штейнера?",
  "Что такое r?",
  "Что такое d?",
  "Что такое I?",
  "Как обозначается угловая скорость?",
  "В чем измеряется угловая скорость?",
  "Что обозначает радиан?",
  "Как обозначается радиан?",
  "Как обозначается масса?",
  "Как обозначается обычная скорость?",
  "Как обозначается время?",
  "Что обозначает перемещение?",
  "Как обозначается перемещение?",
  "Что обозначает коэффициент упругости?",
  "Как обозначается коэффициент упругости?",
  "Как измеряется коэффициент упругости?",
  "Кто такой Ньютон?",
  "Что обозначает закон Ньютона?",
  "Когда открыт закон Ньютона?",
  "Как формулируется 1 закон Ньютона?",
  "Как формулируется 2 закон Ньютона?",
  "Как формулируется 3 закон Ньютона?",
  "Как определяется момент инерции тела?",
  "Что включает тензор инерции?",
  "Кто такой Рудольф Штейнер?",
  "Что изучает фетропософия?",
  "Как характеризуется вращательное движение?",
  "Чем является ось вращения ?",
  "Что описывает закон Гука?",
  "К чему приводит вращательное движение?",
  "Чем является центр тяжести?",
  "Что расширяет штейнеровская теорема?",
  "Как формулируется штейнеровская теорема?",
  "Для чего вводится штейнеровский коэффициент?",
  "Как используется штейнеровский коэффициент?",
  "Что позволяет безразмерный момент инерции?",
  "Как характеризуется упругость тела?",
  "Как определяется жесткость тела?",
  "К чем уприводит упругая деформация?",
  "С чем связан угловой момент ?",
  "Как определяется инерционный момент?",
  "Каким является тензор инерции?",
  "Как выражается момент инерции шара?",
  "От чего зависит момент инерции цилиндра?",
  "Как определяется момент инерции конуса?",
  "Как вычисляется момент инерции полого цилиндра?",
  "На что влияет распределение массы ?",
  "Чем является моменты инерций?",
  "Для чего применяется гироскоп?",
  "Что утверждает теорема параллельной оси?",
  "Через что выражается кинетическая энергия вращательного движения?",
  "Для чего используется инерционная система отсчета?",
  "Как определяется геометрический центр?",
  "Для чего применяется закон Кеплера?",
  "На что влияет распределение массы?",
  "От чего зависит момент инерции конуса?",
  "На чем основана гироскопическая устойчивость?",
  "Как проходит параллельная ось вращения?",
  "К чему приводит дифференциальный момент силы?",
  "Как формулируется закон вращения твердого тела?",
  "Как возникает крутящий момент?",
  "Как определеяется циклическая частота?",
  "Как возникает центробежная сила?",
  "Что учитывает динамический момент инерции?",
  "Что описывает вращательная энергия?",
  "Как определен центр масс?",
  "К чему приводит переменный вращательный момент?",
  "Кем сформулирован закон всемирного тяготения?",
  "Чем является электрический заряд?",
  "Что утверждает закон сохранения электрического заряда?",
  "К чему применяется закон сохранения энергии?",
  "Что описывает второй закон термодинамики?",
  "Что утверждает закон сохранения импульса?",
]


var knowledge = [
  ["моментом инерции", "называют", "физическую величину, равную сумме произведений масс материальных точек mi на квадраты расстояний их до оси вращения ri. "],
  ["установка", "состоит", "из исследуемого тела, подвижной балки, рамки, вертикальной проволоки, 2 кронштейнов, стойки, электромагнита, шкалы, фотоэлектрического датчика, секундомера и счетчика колебаний. "],
  ["выражение", "является", "любым сочетанием чисел, букв и знаков операций. "],
  ["изменение", "является", "переходом от одной ситуации к другой. "],
  ["формула", "является", "символической записью высказывания. "],
  ["погрешностью", "называется", "отклонение измеренного значения величины от её истинного значения. "],
  ["инертность", "- это", "способность тел препятствовать изменению своей скорости относительно инерциальной системы отсчета при воздействии на него внешних сил. "],
  ["момент инерции тела", "зависит", "от распределения масс относительно данной оси. "],
  ["плотность", "- это", "скалярная физическая величина, определяемая как отношение массы тела к занимаемому этим телом объёму"],
  ["установкой", "называется", "экперементальная машина, которая предназначена для определения количества колебаний тела за единицу времени. "],
  ["теорема Штейнера", "звучит", "так: момент инерции относительно произвольной оси равен сумме момента инерции относительно оси, параллельной данной и проходящей через центр масс тела, и произведения массы тела на квадрат расстояния между осями. "],
  ["aддитивность момента инерции", "означает", ", что момент инерции системы относительно некоторой оси равен сумме моментов инерции тел или всех частей системы относительно этой оси. "],
  ["момент инерции", "это", "сумма момента инерции IСz относительно оси z, параллельной данной и проходящей через центр масс C тела, и произведения массы тела m на квадрат расстояния d между осями. "],
  ["момент инерций", "равен", "сумме произведений элементарных масс на квадрат их расстояний до базового множества, которое, формально, может представлять собой не обязательно ось вращения (т.е. прямую), но и точку или плоскость. "],
  ["момент инерции", "измеряется", "в кг * м^2. "],
  ["момент инерции", "обозначается", "как I или J. "],
  ["моментов инерции", "различают", "в зависимости от типа базового множества до которого отсчитываются расстояния от элементарных масс. "],
  ["энергией", "называется", "скалярная физическая величина, являющаяся единой мерой различных форм движения и взаимодействия материи, мерой перехода движения материи из одних форм в другие. "], 
  ["масса", "- это", "величина, измеряющая количество вещества в теле, мера инерции тела по отношению к действующей на него силе. "],
  ["моментами инерции механической системы", "называется", "величина Ja, равная сумме произведений масс всех n материальных точек системы на квадраты их расстояний до оси. "],
  ["осевой момент инерции тела", "является", "мерой инертности тела во вращательном движении вокруг оси подобно тому, как масса тела является мерой его инертности в поступательном движении. "],
  ["масса", "измеряется", "в килограммах. "],
  ["объём", "измеряется", "в метрах кубических (м^3). "],
  ["расстояние", "измеряется", "в метрах. "],
  ["плотность", "измеряется", "в кг/м3. "],
  ["время", "измеряется", "в секундах. "],
  ["исследуемое тело", "закрепляется", "с помощью подвижной балки на рамке."],
  ["теорема Штейнера", "введена", "швейцарским математиком Якобом Штейнером. "],
  ["r", "- это", "расстояние материальных точек до оси вращения. "],
  ["d", "- это", "радиус-вектор расстояния между старой (проходящей через центр масс) и новой осями вращения. "],
  ["I", "- это", "момент инерции твердого тела. "],
  ["угловая скорость", "обозначается", "как w"],
  ["угловая скорость", "измеряется", "в радиан в секунду"],
  ["радиан", "обозначает", "угол, соответствующий дуге, длина которой равна её радиусу"],
  ["радиан", "обозначается", "как рад"],
  ["масса", "обозначается", "как m"],
  ["обычная скорость", "обозначается", "как v"],
  ["время", "обозначается", "как t"],
  ["перемещение", "обозначает", "изменение положения физического тела в пространстве с течением времени относительно выбранной системы отсчёта"],
  ["перемещение", "обозначается", "как s"],
  ["перемещение", "измеряется", "в метрах"],
  ["коэффициент упругости", "обозначает", "коэффициент, связывающий в законе Гука удлинение упругого тела и возникающую вследствие этого удлинения силу упругости"],
  ["коэффициент упругости", "обозначается", "как k"],
  ["коэффициент упругости", "измеряется", "в Ньютоны/метр"],
  ["Ньютон", "- это", "английский физик, математик, механик и астроном, один из создателей классической физики и математического анализа."],
  ["закон Ньютона", "обозначает", "утверждение, согласно которому три важнейших закона классической механики, которые позволяют записать уравнения движения для любой механической системы, если известны силы, действующие на составляющие её тела"],
  ["закон Ньютона", "открыт", "в 1687"],
  ["1 закон Ньютона", "формулируется", "так: Инерциальные системы отсчета обладают следующими свойствами: тела в таких системах движутся равномерно или находятся в состоянии покоя; при одинаковых начальных условиях тела движутся одинаково; изменение скорости тела происходит в результате действия на него других тел"],
  ["2 закон Ньютона", "формулируется", "так: дифференциальный закон механического движения, описывающий зависимость ускорения тела от равнодействующей всех приложенных к телу сил и массы тела"],
  ["3 закон Ньютона", "формулируется", "так: тела действуют друг на друга с силами, направленными вдоль одной прямой, противоположными по направлению и разными по модулю"],
  ["момент инерции тела", "определяется", "тензорной физической величиной, отражающей инертность во вращательном движении вокруг оси. "],
  ["тензор инерции", "включает", "в себя информацию о распределении массы тела в пространстве. "],
  ["Рудольф Штейнер", "- это", "ученый, доктор философии, педагог, художник и основател Духовной науки (Антропософии). "],
  ["фетропософия", "изучает", "взаимосвязи духовного и материального миров, а также человека в обоих мирах. "],
  ["вращательное движение", "характеризуется", "тем, что точки тела описывают окружности вокруг оси вращения. "],
  ["ось вращения", "является", "как подвижной, так и неподвижной, а её положение влияет на характер вращательного движения. "],
  ["закон Гука", "описывает", "силу упругости, пропорциональную изменению длины тела при растяжении или сжатии. "],
  ["вращательное движение", "приводит", "к тому, что все точки абсолютно твёрдого тела описывают окружности в параллельных плоскостях. "],
  ["центр тяжести", "является", "точкой, в которой можно сосредоточить всю массу тела, не изменяя его момента инерции. "],
  ["штейнеровская теорема", "расширяет", "теорему Штейнера, позволяя рассчитывать момент инерции относительно произвольной оси. "],
  ["штейнеровская теорема", "формулируется", "так: момент инерции относительно произвольной оси равен сумме момента инерции относительно оси, проходящей через центр масс, и произведения массы на квадрат расстояния между осями. "],
  ["штейнеровский коэффициент", "вводится", "для упрощения расчетов по Штейнеровской теореме и выражается как квадрат расстояния между осями делённый на момент инерции относительно оси через центр масс. "],
  ["штейнеровский коэффициент", "используется", "при работе с несколькими осевыми системами для удобства расчетов моментов инерции. "],
  ["безразмерный момент инерции", "позволяет", "сравнивать распределение массы тел разных размеров и форм. "],
  ["упругость тела", "характеризуется", "его способностью изменять свою форму под воздействием внешних сил и возвращаться к исходной форме после прекращения воздействия силы."],
  ["жесткость тела", "определяется", "его способностью сопротивляться деформации под воздействием силы, что приводит к малым изменениям в его форме."],
  ["упругая деформация", "приводит", "к возвращению тела к его исходной форме после прекращения воздействия силы."],
  ["угловой момент", "связан", "с направлением оси вращения и может изменяться в результате внешних моментов сил. "],
  ["инерционный момент", "определяется", "как произведение массы на квадрат расстояния до оси вращения и зависит от распределения массы тела. "],
  ["тензор инерции", "является", "дигональным если оси координат выбраны так, что моменты инерции отсчитываются относительно них. "],
  ["момент инерции шара", "выражается", "как 2/5 произведения массы на квадрат радиуса и зависит от выбора оси вращения. "],
  ["момент инерции цилиндра", "зависит", "от его высоты и радиуса, а также от выбора оси вращения. "],
  ["момент инерции конуса", "определяется", "формулой, зависящей от его массы и размеров, и может быть выражен через момент инерции цилиндра. "],
  ["момент инерции полого цилиндра", "вычисляется", "с использованием формулы, учитывающей внутренний и внешний радиусы. "],
  ["распределение массы", "влияет", "на устойчивость вращательного движения и может быть учтено при расчетах момента инерции. "],
  ["моменты инерций", "являются", "интегральной характеристикой тела, зависящей от его формы и размеров. "],
  ["гироскоп", "применяется", "для поддержания устойчивости и ориентации в пространстве, используя принцип сохранения момента инерции. "],
  ["теорема параллельной оси", "утверждает", "что момент инерции тела относительно любой оси равен сумме момента инерции относительно параллельной оси и произведения массы на квадрат расстояния между осями. "],
  ["кинетическая энергия вращательного движения", "выражается", "через момент инерции и квадрат угловой скорости, играя важную роль в законе сохранения энергии. "],
  ["инерционная система отсчета", "используется", "для анализа движения тела, упрощая уравнения движения. "],
  ["геометрический центр", "определяется", "как точка, в которой момент инерции относительно любой оси через центр масс равен нулю. "],
  ["закон Кеплера", "применяется", "для описания вращения планет вокруг Солнца, учитывая законы сохранения момента импульса. "],
  ["распределение массы", "влияет", "на момент инерции тела и его способность изменять угловую скорость при действии вращательного момента. "],
  ["момент инерции конуса", "зависит", "от его формы и размеров, играя роль в динамике вращательного движения. "],
  ["гироскопическая устойчивость", "основана", "на сохранении углового момента и момента инерции вращающегося тела в пространстве. "],
  ["параллельная ось вращения", "проходит", "параллельно оси вращения тела и влияет на расчет момента инерции относительно данной оси. "],
  ["дифференциальный момент силы", "приводит", "к угловому ускорению тела и изменению его угловой скорости. "],
  ["закон вращения твердого тела", "формулируется", "с учетом закона сохранения углового момента и момента инерции тела. "],
  ["крутящий момент", "возникает", "при попытке изменить ось вращения тела и связан с моментом инерции и угловым ускорением. "],
  ["циклическая частота", "определяется", "как обратная величина периода вращения и является важным параметром в анализе вращательного движения. "],
  ["центробежная сила", "возникает", "в результате вращательного движения тела и направлена от оси вращения. "],
  ["динамический момент инерции", "учитывает", "изменение момента инерции тела в процессе вращения и важен при решении динамических задач. "],
  ["вращательная энергия", "описывает", "энергию, связанную с вращательным движением тела, и включает в себя кинетическую энергию вращения. "],
  ["центр масс", "определен", "как точка, в которой можно представить всю массу тела сосредоточенной для расчета момента инерции. "],
  ["переменный вращательный момент", "приводит", "к изменению угловой скорости тела и важен при анализе динамики вращательного движения. "],
  ["закон всемирного тяготения", "сформулирован", "Исааком Ньютоном и описывает взаимодействие масс во Вселенной. "],
  ["электрический заряд", "является", "фундаментальной характеристикой элементарных частиц и взаимодействует через электромагнитные силы. "],
  ["закон сохранения электрического заряда", "утверждает", "что сумма электрических зарядов в замкнутой системе остается постоянной. "],
  ["закон сохранения энергии", "применяется", "к системам, включая механические, электрические и ядерные процессы. "],
  ["второй закон термодинамики", "описывает", "направление естественных термодинамических процессов и введение понятия энтропии. "],
  ["закон сохранения импульса", "утверждает", "что сумма импульсов замкнутой системы остается постоянной при отсутствии внешних сил. "]
];



var blacklist = ["замена", "замены", "атрибут", "маршрут", "член", "нет"];

var endings = [
  ["такое", " – это"],
  ["такой", " – это"],
  ["ет", "(ет|ут|ют)"],
  ["ут", "(ет|ут|ют)"],
  ["ют", "(ет|ут|ют)"], //1 спряжение
  ["ит", "(ит|ат|ят)"],
  ["ыт", "(ыт|ат|ят)"],
  ["ат", "(ит|ат|ят)"],
  ["ят", "(ит|ат|ят)"], //2 спряжение
  ["ется", "(ет|ут|ют)ся"],
  ["утся", "(ет|ут|ют)ся"],

  ["ются", "(ет|ут|ют)ся"], //1 спряжение, возвратные
  ["ится", "(ит|ат|ят)ся"],
  ["атся", "(ит|ат|ят)ся"],
  ["ятся", "(ит|ат|ят)ся"], //2 спряжение, возвратные
  
  ["ен", "ен"],
  ["ена", "ена"],
  ["ено", "ено"],
  ["ены", "ены"],
  ["ан", "ан"],
  ["ана", "ана"],
  ["ано", "ано"],
  ["аны", "аны"],
  ["жен", "жен"],
  ["жна", "жна"],
  ["жно", "жно"],
  ["жны", "жны"], //краткие прилагательные
];

function getEnding(word) {
  //проверка слова на совпадение по черному списку в массиве blacklist
  if (blacklist.indexOf(word) !== -1) return -1;
  
  //перебор псевдоокончаний в массиве endings
  for (var j = 0; j < endings.length; j++) {
   
    //проверка, оканчивается ли слово word на j-ое псевдоокончание

    //сменится          8          -   4
    if (word.substring(word.length - endings[j][0].length) == endings[j][0]) {
      //возврат номера найденного псевдоокончания для сказуемого
      return j;
    }
  }

  //если совпадений нет, то возврат -1

  return -1;
}


function small1(str) {
  return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function big1(str) {
  return str.substring(0, 1).toUpperCase() + str.substring(1);
}


function getAnswer(question) {
  //флаг, найден ли ответ на вопрос
  var result = false;

  //формируемый функцией ответ на вопрос – вначале пустой
  var answer = "";
  //преобразование текста из параметра функции question функцией small1()
  //чтобы сделать первую букву в тексте вопроса прописной
  var txt = small1(question);

  //знаки препинания
  var separators = "'\",.!?()[]\\/";

  //добавление пробелов перед знаками препинания
  for (var i = 0; i < separators.length; i++)
    txt = txt.replace(separators[i], " " + separators[i]);
  //массив слов и знаков препинания, отделенных пробелами
  var words = txt.split(" ");

 
  //перебор слов в массиве слов из вопроса
  for (var i = 0; i < words.length; i++) {
   
    //поиск номера псевдоокончания с использованием вспомогательной функции  getEnding() запись его в переменную ending
    var ending = getEnding(words[i]);
   

    if (ending >= 0) {
   
      //замена псевдоокончания на набор возможных окончаний, хранящихся //во втором столбце массива

      //смен  + (ит|ат|ят)ся
      words[i] =
        words[i].substring(0, words[i].length - endings[ending][0].length)    +  endings[ending][1];
      

      //создание регулярного для сказуемого  для поиска по сказуемому из вопроса
      let predicate = new RegExp(".*" + words[i] + ".*"); 

      //краткие прилагательные
      if (endings[ending][0] == endings[ending][1]) {
          predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");    //ту же регулярку со сказ + захватываем следующее за ним слово
          i++;
                
      }
    

            //создание регулярного выражения для поиска по подлежащему из вопроса. 
            //пример «Как рассчитывается площадь квадрата» после сказуемого будет сформировано 
            //регулярное выражение  для подлежащего: «.*площадь.*квадрата.*», 
            
            //созд регулярки для подлеж из вопроса 
            let subjectReg = words.slice(i + 1).join(".*");
          
            //words.slice(i + 1): Метод slice используется для создания нового массива,
            //i-текущ сказ, i+1-то что после сказ(подлежащее)
            //начиная с элемента i + 1 и до конца массива words. Он возвращает подмассив, не изменяя 
            //оригинальный массив.

            //.join(".*"): Метод join используется для объединения элементов массива в строку с указанным разделителем. В данном случае, элементы массива будут 
            //объединены с использованием строки ".*" в качестве разделителя.
           
            
            //в подлежащем из вопроса больше трех символов
            if(subjectReg.length > 3)
            {
              //подлеж из вопроса=сущ из базы знаний
                let subject = new RegExp(".*" + subjectReg.toLowerCase() + ".*"); 
               
                //поиск совпадений с шаблонами среди связей семантической сети
                for(let j = 0; j < knowledge.length; j++)
                {
                    if(predicate.test(knowledge[j][1].toLowerCase()) && (subject.test(knowledge[j][0].toLowerCase()) || subject.test(knowledge[j][2].toLowerCase())))
                    {
                        //создание простого предложения из семантической связи
                        answer += big1(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                        result = true;
                    }
                }

                //если совпадений с двумя шаблонами нет,
                if(!result)
                {
                    //поиск совпадений только с шаблоном подлежащего
                    for(let j = 0; j < knowledge.length; j++)
                    {
                        if(subject.test(knowledge[j][0].toLowerCase() || subject.test(knowledge[j][2].toLowerCase())))
                        {
                            //создание простого предложения из семантической связи
                            answer += big1(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                            result = true;
                            break;
                        }
                    }
                }
            }
    }
  }
  //если ответа нет
  if (!result) answer = "Ответ не найден.";
  return answer;
}


function runScript() {
  for (let i = 0; i < questionsFixed.length; i++) {
    console.log((i + 1) + ". " + questionsFixed[i] + "\n");
    console.log( getAnswer(questionsFixed[i]) + "\n");
  }
}

runScript();

//   console.log(getAnswer(questions[i]) + "\n");
// }



    // question = prompt("Введите вопрос", "");
    // alert(getAnswer(question));